AndyKorg/ClockMatrix/ClockMatrix/esp8266hal.c
/*
 * Протокол общения с esp8266
 * см. ..\Web_base\app\include\customer_uart.h
 */ 
#include <avr/io.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#include <avr/pgmspace.h>
#include <stdlib.h>
#include <string.h>
#include "FIFO.h"
#include "Clock.h"
#include "esp8266hal.h"
#include "bits_macros.h"
#include "EERTOS.h"
#include "Alarm.h"
#include "Sound.h"
#include "sensors.h"
#include "i2c.h"
#include "Display.h"
#include "eeprom.h"

#ifdef ATMEGA644
	#ifdef DEBUG
		#include "usartDebug.h"
	#endif
#endif

#ifdef ATMEGA644
	#define ESP_UART_DATA	UDR1								//Регистр данных для esp
	#define ESP_UCSRA		UCSR1A
	#define ESP_UCSRB		UCSR1B
	#define ESP_TXC			TXC1								//Буфер передачи пуст
	#define ESP_RXC			RXC1								//Принят байт
	#define ESP_UDRE		UDRE1
	#define ESP_UDRIE		UDRIE1								//Разрешить прерывания по окончании передачи
	#define ESP_RXCIE		RXCIE1								//Разрешить прерывания по окончания приема байта
	#define ESP_UARTRX_vect	USART1_RX_vect						//Прерывание по приему байта от esp
	#define ESP_UARTTX_vect USART1_UDRE_vect					//Прерывание по окончании передачи байта в esp
#else
	#define ESP_UART_DATA	UDR									//Регистр данных для esp
	#define ESP_UCSRA		UCSRA
	#define ESP_UCSRB		UCSRB
	#define ESP_TXC			TXC									//Буфер передачи пуст
	#define ESP_RXC			RXC									//Принят байт
	#define ESP_UDRE		UDRE
	#define ESP_UDRIE		UDRIE								//Разрешить прерывания по окончании передачи
	#define ESP_RXCIE		RXCIE								//Разрешить прерывания по окончания приема байта
	#define ESP_UARTRX_vect	USART_RXC_vect						//Прерывание по приему байта от esp
	#define ESP_UARTTX_vect USART_UDRE_vect						//Прерывание по окончании передачи байта в esp
#endif

#define espSendRdy()	BitIsSet(ESP_UCSRA, ESP_TXC)			//Передатчик в esp готов принять данные
#define espSendWhite()	while(BitIsClear(ESP_UCSRA, ESP_TXC))	//Ожидание окончания передачи в  esp
#define espRxWhile()	while(BitIsClear(ESP_UCSRA, ESP_RXC))	//Ожидание приема байта от esp
#define espRxStart()	SetBit(ESP_UCSRB, ESP_RXCIE)			//Разрешить прерывание при приеме байта
#define espRxStop()		ClearBit(ESP_UCSRB, ESP_RXCIE)
#define epsTxStart()	SetBit(ESP_UCSRB, ESP_UDRIE)			//Разрешить прерывание по готовности передатчика
#define espTxStop()		ClearBit(ESP_UCSRB, ESP_UDRIE)			//запретить

#define ESP_RESET_PORT	PORTA									//Порт ноги сброса esp
#define ESP_RESET_DDR	DDRA
#define ESP_RESET_BIT	PORTA3
#define espResetInit()	do{SetBit(ESP_RESET_DDR, ESP_RESET_BIT); SetBit(ESP_RESET_PORT, ESP_RESET_BIT);}while(0)
#define espReset()		ClearBit(ESP_RESET_PORT, ESP_RESET_BIT)
#define espStart()		SetBit(ESP_RESET_PORT, ESP_RESET_BIT)

#define ESP_ERR_TIMEOUT	2000										//Максимальное время ожидания ответа от модуля, мс

#define CMD_CLCK_PILOT1		0xaa								//Первый байт пилота команды
#define CMD_CLCK_PILOT2		0x55								//Второй байт пилота команды
#define CLK_CMD_PILOT_NUM	4									//Длина пилота для команды

#define CLK_CMD_EMPTY	0x00									//Специальная пустая команда, или буфер команды пуст
#define CLK_TIMEOUT		3000									//Таймаут ожидания завершения ответа от часов мс

#define CLK_MAX_LEN_CMD	32										//Максимальная длина команды uart. Должна быть степенью двойки см. fifo.h

//Буфер FIFO данных для приема и передачи
FIFO(CLK_MAX_LEN_CMD)
	espTxBuf, espRxBuf;

//############################ Команды и переменные UART  ###########################################################################################
typedef void (*VOID_CLK_UART_CMD)(u08 cmd, u08* pval, u08 valLen);//Сама команда и её данные

typedef const PROGMEM struct{									//Команда UART
	u08 CmdCode;
	VOID_CLK_UART_CMD Func;										//Если Value не NULL, то функция не вызывается
} PROGMEM pEspUartCmd;

//Команды поступающие от модуля esp
void UartWatchSet(u08 cmd, u08* pval, u08 valLen);				//Записать время от esp
void UartAlarmSet(u08 cmd, u08* pval, u08 valLen);				//Сохранить значение будильников
void UartVolumeSet(u08 cmd, u08* pval, u08 valLen);				//Громкость
void UartSensorSet(u08 cmd, u08* pval, u08 valLen);				//Управление датчиками
void UartFontSet(u08 cmd, u08* pval, u08 valLen);				//Установить шрифт
void UartGetAll(u08 cmd, u08* pval, u08 valLen);				//Прочитать все установки часов
void UartBaseModeSet(u08 cmd, u08* pval, u08 valLen);			//Возврат в основной режим при получении команды CLC_STOP
void UartStationIP(u08 cmd, u08* pval, u08 valLen);				//Получен IP адрес station
void UartHorizontalSpeed(u08 cmd, u08* pval, u08 valLen);		//Установить скорость бегущей строки

//-------------------- Список команд и переменных для приема по UART ---------------------------------------------------
#define UART_CMD_NUM_MAX 9										//Количество команд uart
const pEspUartCmd PROGMEM espUartCmd[UART_CMD_NUM_MAX] = {
	/*	CmdCode, 		Func */
	{CLK_WATCH,			UartWatchSet},
	{CLK_ALARM, 		UartAlarmSet},
	{CLK_VOLUME,		UartVolumeSet},
	{CLK_SENS,			UartSensorSet},
	{CLK_FONT,			UartFontSet},
	{CLK_STOP,			UartBaseModeSet},
	{CLK_ALL,			UartGetAll},
	{CLK_ST_WIFI_IP,	UartStationIP},
	{CLK_HZ_SPEED, 		UartHorizontalSpeed},
		
/*
--#define CLK_NTP_START	0x03	//Запустить получение времени от ntp сервера
#define CLK_STOP		0x08	//Остановить операцию (тестирование или ожидание)

//Ответы
#define CLK_NTP_ERROR	0x70	//Ошибка обращения к серверу ntp
*/	
};
#define espCmdCode(id)			(pgm_read_byte(&espUartCmd[id].CmdCode))
#define espCmdExec(id)			*((VOID_CLK_UART_CMD*)pgm_read_word(&espUartCmd[id].Func))

volatile u08  espStatusFlags;									//Состояние модуля - флаг таймаут, счетчик попыток связи с модулем
//								7								
//								6
//								5	свободные биты
//								4
#define ESP_ATTEMPT_MASK		0b00001111						//Маска счетчика попыток связи с модулем

#define espAttemptLinkSet()		do{espStatusFlags |= ESP_ATTEMPT_MASK;}while(0)
#define espAttemptIsEnded()		((espStatusFlags & ESP_ATTEMPT_MASK)==0)	//Попытки исчерпаны
#define espTimeoutGoing()		(espStatusFlags & ESP_ATTEMPT_MASK)	//Работает таймер таймаута

void espTimeoutError(void);										//Проверка времени ответа модуля

u08* espStationIP = NULL;										//Адрес IP в виде строки XXX.XXX.XXX.XXX

