AndyKorg/ClockMatrix/ClockMatrix/esp8266hal.c
/************************************************************************/
/* Передать данные в esp                                                */
/************************************************************************/
void espUartTx(u08 Cmd, u08* Value, u08 Len){
	if espModuleIsNot()											//Нет модуля, ничего не делаем
		return;
	while(FIFO_SPACE(espTxBuf) < (Len+6)){						//Ждем пока буфер не освободится
		TaskManager();
		if espModuleIsNot(){									//Не удалось определить наличие модуля
			return;
		}
	}

	u08 FlagInt = SREG & SREG_I;
	cli();														//Формируется пакет
	FIFO_PUSH(espTxBuf, CMD_CLCK_PILOT1);
	FIFO_PUSH(espTxBuf, CMD_CLCK_PILOT2);
	FIFO_PUSH(espTxBuf, CMD_CLCK_PILOT1);
	FIFO_PUSH(espTxBuf, CMD_CLCK_PILOT2);
	FIFO_PUSH(espTxBuf, Len);
	while(Len){
		FIFO_PUSH(espTxBuf, *Value++);
		Len--;
	}
	FIFO_PUSH(espTxBuf, Cmd);
	epsTxStart();
	if (FlagInt)
		sei();
	espAttemptLinkSet();
	SetTimerTask(espTimeoutError, ESP_ERR_TIMEOUT);				//Таймаут ответа от модуля
}

/************************************************************************/
/* Начальная установка переменных модуля                                */
/************************************************************************/
void espVarInit(void){
	u08 i;
	
	espNetNameSet();											//Авторизовать в сети wifi как station если есть имя сети и пароль на sd-карте
	espWatchTx();												//Время
	for (i=0;i<ALARM_MAX;i++){									//Будильники
		espUartTx(ClkWrite(CLK_ALARM), (u08*) ElementAlarm(i), sizeof(struct sAlarm));
	}
	espVolumeTx(vtAlarm);										//Громкости и сигналы
	espVolumeTx(vtButton);
	espVolumeTx(vtEachHour);
	for(i=0;i<SENSOR_MAX;i++)									//Датчики
		espSendSensor(i);
	i = FontIdGet();
	espUartTx(ClkWrite(CLK_FONT), &i, 1);						//Шрифт
	if (RTC_IsNotValid())										//Был сбой питания, запустить запрос времени из Интернета
		StartGetTimeInternet();

	u08 HZConst[HORZ_SCROLL_CMD_COUNT];							//Скорость бегущей строки - нужно 2 байта, один для передачи количества шагов, один для текущего значения скорости				
	HZConst[0] = HORZ_SCROLL_STEPS;
	HZConst[1] = HorizontalSpeed/HORZ_SCROOL_STEP;
	espUartTx(ClkWrite(CLK_HZ_SPEED), HZConst, HORZ_SCROLL_CMD_COUNT);
}

/************************************************************************/
/* Начать тест модуля													*/
/************************************************************************/
void espCheckStart(void){
	u08 i;
	espUartTx(ClkTest(CLK_CMD_EMPTY), &i, 1);					//Отправляем тестовую команду
}

/************************************************************************/
/* Таймаут ответа от модуля												*/
/************************************************************************/
void espTimeoutError(void){
	if (espAttemptIsEnded()){								//Остались попытки?
		espModuleRemove();									//Считаем, что модуль отсутствует
	}
	else{
		espStatusFlags--;									//Минус одна попытка
		espReset();											//Сбрасываем
		FIFO_FLUSH(espTxBuf);
		//SetTimerTask(espCheckStart, CLK_TIMEOUT);			//И запускаем проверку модуля
		espStart();
		SetTimerTask(espTimeoutError, ESP_WHITE_START);		//Ждем пока модуль не перестартует
	}
}

/************************************************************************/
/* Поиск и исполнение команды в принятых данных							*/
/************************************************************************/
void espParse(void){
	u08 Len = FIFO_FRONT(espRxBuf);
	u08* ptrData = malloc(Len);
	
	if (ptrData == NULL)										//Не хватило памяти для обработки команды, подождем может появится
		SetTask(espParse);
	else{
		u08* Data = ptrData;
		FIFO_POP(espRxBuf);
		for(u08 i=Len;i;i--){									//Извлекаем данные из буфера
			*Data = FIFO_FRONT(espRxBuf);
			Data++;
			FIFO_POP(espRxBuf);
		}
		u08 Cmd = FIFO_FRONT(espRxBuf);
		FIFO_POP(espRxBuf);
		for (u08 i=0; i < UART_CMD_NUM_MAX; i++) {
			if (espCmdCode(i) == ClkCmdCode(Cmd)){				//Команда найдена
				((VOID_CLK_UART_CMD)&espCmdExec(i))(Cmd, ptrData, Len);//Отрабатываем
				break;
			}
		}
		free(ptrData);
	}
}
/************************************************************************/
/* Принят байт от esp                                                   */
/************************************************************************/
ISR(ESP_UARTRX_vect){
	u08 rxbyte = ESP_UART_DATA;
	static u08 CountByte = 0, CountData = 0;
	
	#define CountByteVal()		(CountByte & 0x3f)
	#define SetCustomTxtCmd()	SetBit(CountByte, 7)			//Специальная команда для произвольного текста
	#define CustomTxtCmdIsSet()	BitIsSet(CountByte, 7)
	#define CustomTxtEnd()		SetBit(CountByte, 6)			//Был конец произвольной строки
	#define CustomTxtIsNoEnd()	BitIsClear(CountByte, 6)			
	
	if (CountByteVal() < CLK_CMD_PILOT_NUM){					//Ожидаются пилот-байты
		if (rxbyte == ((CountByte & 1)?CMD_CLCK_PILOT2:CMD_CLCK_PILOT1)) //Ждем соответствующий байт пилота
			CountByte++;
		else
			CountByte = 0;
	}
	else{														//Есть синхронизация
		espModuleSet();											//Флаг наличия модуля установить
		espAttemptLinkSet();									//Максимальное количество попыток связи с модулем
		if (CountByteVal() == CLK_CMD_PILOT_NUM){				//Принята длина данных
			CountData = rxbyte;
			CountByte++;
			if (rxbyte > CLK_MAX_LEN_CMD){						//Если количество данных больше максимальной длины команды, то это специальная команда CLK_CUSTOM_TXT
				SetCustomTxtCmd();
				CountData++;									//Добавляю единицу что бы код команды то же принять как данные
				ClearDisplay();									//Подготовить дисплей
				CreepOn(1);
			}
			else{
				if ((rxbyte+2)>FIFO_SPACE(espRxBuf)){			//При нехватке места в буфере обычная команда сбрасывается
					CountByte = 0;								//Число 2 это байт длины и байт команды
				}
				else{											//есть свободное место в буфере, суем туда длину данных
					FIFO_PUSH(espRxBuf, rxbyte);
				}
			}
		}
		else{
			if CustomTxtCmdIsSet(){								//Специальная команда произвольного текста, пишется сразу в буфер дисплея
				if ((CountData != 1) && CustomTxtIsNoEnd()){	//последний байт это код команды, его надо игнорировать и конца строки еще не было
					if (rxbyte){								//Нулевой байт это конец строки, после него ничего не выводится
						if (rxbyte == '_')						//Пока подчеркивание переделывается в пробел из-за бага в прошивке esp8266
							sputc(S_SPACE, UNDEF_POS);
						else
							sputc(rxbyte, UNDEF_POS);
						sputc(S_SPICA, UNDEF_POS);
					}
					else{
						sputc(S_SPICA, UNDEF_POS);
						CustomTxtEnd();
					}
				}
			}
			else{
				FIFO_PUSH(espRxBuf, rxbyte);					//Принимается поток данных и код команды
			}
			if (CountData){										//Еще не все принято, продолжаем
				CountData--;
			}
			else{												//Все принято
				if (CustomTxtCmdIsSet())						//Если специальная команда произвольного текста, то запустить вывод температуры и прочего
					ShowDate();
				else
					SetTask(espParse);
				CountByte = 0;									//Запустить цикл по новой
			}
		}
	}
}

