AndyKorg/ClockMatrix/ClockMatrix/esp8266hal.c
/************************************************************************/
/* Передатчик пуст, можно дальше передавать                             */
/************************************************************************/
ISR(ESP_UARTTX_vect){
	if( FIFO_IS_EMPTY(espTxBuf) ) {								//если данных в fifo больше нет то запрещаем это прерывание
		espTxStop();
	}
	else {														//иначе передаем следующий байт
		u08 txbyte = FIFO_FRONT(espTxBuf);
		FIFO_POP(espTxBuf);
		ESP_UART_DATA = txbyte;
	}
}

/************************************************************************/
/* Инициализация USART. Если IntOn - 1 то включаются прерывания         */
/************************************************************************/
#define ESP_SERIAL_INT_ON	1
#define ESP_SERIAL_INT_OFF	0
inline void espSerialIni(u08 IntOn){

#ifdef ATMEGA644
	//-------- Настройка порта для модуля
	#undef BAUD											//Для пересчета скорости для модуля
//	#define BAUD 9600
	#define BAUD 115200
	#include <util/setbaud.h>
	UCSR1A = 0x00;										//Все по умолчанию
	UCSR1B = (1<<RXEN1) | (1<<TXEN1) |					//Разрешить прием и передачу
				((IntOn?1:0)<<RXCIE1);					//прерывание от приемника включить при необходимости
	UCSR1C = (0<<UMSEL11) | (0<<UMSEL10) |				//Asynchronius USART
			(0<<UPM11) | (0<<UPM10) |					//Parity off
			(0<<USBS1) |								//Stop bit = 1
			(0<<UCSZ12) | (1<<UCSZ11) | (1<<UCSZ10) |	//8 бит данных
			(0<<UCPOL1);								//Polary XCK не важно т.к. не используется в синхронном режиме
	UBRR1H = UBRRH_VALUE;
	UBRR1L = UBRRL_VALUE;
	#if USE_2X											//Если скорости не хватит подключается умножитель на 2
		UCSR1A |= (1 << U2X1);
	#else
		UCSR1A &= ~(1 << U2X1);
	#endif
#else
	//-------- Настройка порта для модуля
	#undef BAUD											//Для пересчета скорости для модуля
//	#define BAUD 115200
	#define BAUD 19200
	#include <util/setbaud.h>
	ESP_UCSRA = 0x00;									//Все по умолчанию
	ESP_UCSRB = (1<<RXEN) | (1<<TXEN) |					//Разрешить прием и передачу
				((IntOn?1:0)<<RXCIE);					//прерывание от приемника включить при необходимости
	UCSRC =  (1<<URSEL) |								//Запись в UCSRC
			 (0<<UMSEL) |								//Asynchronius USART
			 (0<<UPM1) | (0<<UPM0) |					//Parity off
			 (0<<USBS) |								//Stop bit = 1
			 (0<<UCSZ2) | (1<<UCSZ1) | (1<<UCSZ0) |		//8 бит данных
			 (0<<UCPOL);								//Polary XCK не важно т.к. не используется в синхронном режиме
	UBRRH = UBRRH_VALUE;
	UBRRL = UBRRL_VALUE;
	#if USE_2X											//Если скорости не хватит подключается умножитель на 2
		UCSRA |= (1 << U2X);
	#else
		UCSRA &= ~(1 << U2X);
	#endif
#endif
FIFO_FLUSH(espTxBuf);
FIFO_FLUSH(espRxBuf);
}

/************************************************************************/
/* Инициализация интерфейса и запуск таймаута проверки модуля			*/
/************************************************************************/
void espInit(void){
	espResetInit();										//Ногу ресет модуля инициализировать
	espReset();											//Сбросить модуль
	espSerialIni(ESP_SERIAL_INT_ON);					//Инициализировать USART
	espAttemptLinkSet();								//Куча попыток
	espStart();											//Модуль запустить - т.е. ногу ресет модуля в высокое состояние
	espModuleRemove();									//Считаем что модуль отсутствует
	SetTimerTask(espTimeoutError, ESP_WHITE_START);		//Куча времени на запуск модуля
}

/************************************************************************/
/* Возвращает 1 если модуль установлен                                  */
/* Выведено в функцию, т.к. используется в меню                         */
/************************************************************************/
u08 espInstalled(void){
	return espModuleIsSet()?1:0;
}

/************************  КОНКРЕТНЫЕ КОМАНДЫ ***************************/

/************************************************************************/
/* Установить скорость бегущей строки			                        */
/************************************************************************/
void UartHorizontalSpeed(u08 cmd, u08* pval, u08 valLen){
	if ClkIsWrite(cmd){
		if (valLen == HORZ_SCROLL_CMD_COUNT){			//Должно быть два байта
			if ((pval[0] == HORZ_SCROLL_STEPS) && (pval[1]<=HORZ_SCROLL_STEPS)){	//В допустимом диапазоне
				HorizontalSpeed = HORZ_SCROOL_STEP*((u16)pval[1]);
				EeprmStartWrite();						//Записать в eeprom новое значение
			}
		}
	}
}

/************************************************************************/
/* Запускает процесс запроса времени из Интернета                       */
/************************************************************************/
void StartGetTimeInternet(void){
	u08 i;
	espUartTx(ClkWrite(CLK_NTP_START), &i, 1);
}		

/************************************************************************/
/* принять из модуля значение будильника								*/
/************************************************************************/
void UartAlarmSet(u08 cmd, u08* pval, u08 valLen){
	if ClkIsWrite(cmd){
		if (pval[0]<=ALARM_MAX){
			memcpy(ElementAlarm(pval[0]), (void*)pval, valLen);
			EeprmStartWrite();
		}
		EeprmStartWrite();										//Записать в eeprom
	}
}

/************************************************************************/
/* Установка громкости в модуле			                                */
/************************************************************************/
void espVolumeTx(enum tVolumeType Type){
	struct espVolume Vol;
	
	Vol.id = Type;
	Vol.Volume = VolumeClock[Type].Volume;
	Vol.State = 0;												//Для будильников состояние выключения не важно
	if (Type == vtButton)
		Vol.State = KeyBeepSettingIsSet();
	else if (Type == vtEachHour)
		Vol.State = EachHourSettingIsSet();
	Vol.LevelMetod = VolumeClock[Type].LevelVol;
	espUartTx(ClkWrite(CLK_VOLUME), (u08*) &Vol, sizeof(Vol));
}

/************************************************************************/
/* Принять команду управления громкостью                                */
/************************************************************************/
void UartVolumeSet(u08 cmd, u08* pval, u08 valLen){

