AndyKorg/ClockMatrix/ClockMatrix/esp8266hal.c
	#define espVol	((struct espVolume*)pval)

	if ClkIsWrite(cmd){									//Запись значения
		VolumeClock[espVol->id].Volume = espVol->Volume;
		VolumeClock[espVol->id].LevelVol = espVol->LevelMetod;	//Тип регулирования громкости
		if (espVol->id == vtButton){					//Звук кнопок
			KeyBeepSettingSetOff();
			if (espVol->State)
				KeyBeepSettingSwitch();
		}
		else if(espVol->id == vtEachHour){				//Куранты
			EachHourSettingSetOff();					//Сначала выключаем
			if (espVol->State)
				EachHourSettingSwitch();				//Но надо все таки включить
		}
		EeprmStartWrite();								//Записать в eeprom
	}
	else if ClkIsTest(cmd){								//Тест громкости
		if (SoundIsBusy()){								//Прекратить звук если он звучит
			SoundOff();
			return;
		}
		struct sVolume Tmp=VolumeClock[pval[0]];		//Запомнить предыдущее стостояние
		u08 State = KeyBeepSettingIsSet()?1:0;
		u08 TestType = SND_TEST;						//По умолчанию звук кнопок тестируется
		VolumeClock[espVol->id].LevelVol = vlConst;		//Тип регулирования для всех константа
		VolumeClock[espVol->id].Volume = espVol->Volume;//Уровень громкости
		if(espVol->id == vtEachHour){					
			TestType = SND_TEST_EACH;
			State = EachHourSettingIsSet()?1:0;
			
		}
		else if (espVol->id == vtAlarm){
			TestType = SND_TEST_ALARM;
			State = 0;
			VolumeClock[espVol->id].LevelVol = espVol->LevelMetod;	//Для будильника свой
		}
		SoundOn(TestType);								//Звук и регулятор громкости запустить
		VolumeClock[espVol->id] = Tmp;					//Возвращаем старые значения
		struct espVolume espRet = *espVol;
		espRet.LevelMetod = Tmp.LevelVol;
		espRet.Volume = Tmp.Volume;
		espRet.State = State;
		espUartTx(ClkWrite(CLK_VOLUME), (u08*)&espRet, sizeof(espVol));
	}
}

/************************************************************************/
/* Передача значения сенсора											*/
/************************************************************************/
void espSendSensor(u08 numSensor){
	u08 cmd[sizeof(struct sSensor)+1];
	u08* cmd_ptr = cmd;
	
	memcpy((void*)(cmd_ptr+1), (void *)SensorNum(numSensor), sizeof(struct sSensor));		//Формируется команда записи датчика плюс его индекс
	cmd[0] = numSensor;
	espUartTx(ClkWrite(CLK_SENS), cmd, sizeof(cmd));
}

/************************************************************************/
/* Управление датчиками                                                 */
/************************************************************************/
void UartSensorSet(u08 cmd, u08* pval, u08 valLen){	

	if (ClkIsWrite(cmd)){
		if (pval[0]<=SENSOR_MAX){
			u08 ptr[sizeof(struct sSensor)+1];					//Промежуточный буфер
			memcpy((void*)ptr, (void*)pval, valLen);			//Заполнить буфер
			u08 *p = ptr;										//Указатель на первый элемент
			p++;
			memcpy(SensorNum(pval[0]), (void*)p, valLen-1);
			EeprmStartWrite();									//Записать в eeprom
		}
	}
	else if (ClkIsTest(cmd)){
		for(u08 i=0; i<=SENSOR_MAX;i++){	
			if (SensorNum(i)->Adr == pval[0]){
				CurrentSensorShow = i;
				SetClockStatus(csSensorSet, ssSensWaite);
				espSendSensor(i);
				break;
			}
		}
	}
}

/************************************************************************/
/* Передать в модуль текущее время                                      */
/************************************************************************/
void espWatchTx(void){
	espUartTx(ClkWrite(CLK_WATCH), (u08*) &Watch, sizeof(Watch));
}
/************************************************************************/
/* Принять из модуля время												*/
/************************************************************************/
void UartWatchSet(u08 cmd, u08* pval, u08 valLen){
	if (ClkIsWrite(cmd)){
		while(i2c_Do & i2c_Busy)						//Ожидается освобождение шины I2C
			TaskManager();
		memcpy((void*) &Watch, pval, sizeof(Watch));
		i2c_RTC_DirectWrt();
		if (RTC_IsNotValid())							//Был сбой питания, но теперь он преодолен
			RTC_ValidSet();								//Часы корректны
		if ((ClockStatus == csTune) && (SetStatus == ssTimeSet)){	//Если режим запроса времени из интеренета то сообщить об удачном получении времени
			SetClockStatus(csTune, ssTimeLoaded);
		}
	}
}

/************************************************************************/
/* Установить шрифт в часах                                             */
/************************************************************************/
void UartFontSet(u08 cmd, u08* pval, u08 valLen){
	if (*pval<FONT_COUNT_MAX){
		if (ClkIsWrite(cmd)){
			FontIdSet(*pval);
			SetClockStatus(csClock, ssNone);
			EeprmStartWrite();							//Записать в eeprom
		}
	}
}

/************************************************************************/
/* Передача в модуль имя сети и пароля для режима station с SD-карты    */
/************************************************************************/
void espNetNameSet(void){
	#define ESP_NET_VAL "netname="
	#define ESP_PAS_VAL "password="
	
	FRESULT Ret;
	WORD rb;												//Прочитанных байт
	char *NetName, *pass;
	u16 i;

	if NoSDCard() return;									//Нет sd карты - не с чем работать
	if espModuleIsNot() return;								//Модуля нет в системе
	
	if (SoundIsBusy()){
		SetTask(espNetNameSet);								//FatFs занята, попытаемся позже
		return;
	}	

	if (pf_disk_is_mount() != FR_OK){						//Карта еще не определялась, пробуем ее инициализировать.
		Ret = pf_mount(&fs);
		if (Ret != FR_OK) return;
	}
	Ret = pf_open("wifi.cfg");
	if (Ret == FR_OK){
		Ret = pf_lseek (0);
		if (Ret == FR_OK){
			Ret = pf_read(&read_buf0, BUF_LEN, &rb);
			if ((Ret == FR_OK) && (rb>(strlen(ESP_NET_VAL)+strlen(ESP_PAS_VAL)+4))){	//Прочитанных байт должно быть больше имени переменных
				*(read_buf0+rb+1) = 0;						//Конец строки
				for(i=0;i<BUF_LEN;i++){	//всякие переносы строки и прочее в 0
					if (*(read_buf0+i)<0x20){
						*(read_buf0+i) = 0;
					}
				}
				NetName = (void*)strstr((char*)read_buf0, ESP_NET_VAL);	//Имя сети
				if (NetName != NULL){
					NetName += strlen(ESP_NET_VAL);
					for(i=0; *(NetName+strlen(NetName)+i) == 0;i++);	//Пропускаем нули между строками
					pass = (void*)strstr(NetName+strlen(NetName)+i, ESP_PAS_VAL);//Пароль
					if (pass != NULL){
						pass += strlen(ESP_PAS_VAL);
						memset(read_buf1, 0, strlen(NetName)+strlen(pass)+8);
						memcpy(read_buf1, NetName, strlen(NetName));
						memcpy(read_buf1+strlen(NetName)+1, pass, strlen(pass));
//						espUartTx(ClkWrite(CLK_ST_WIFI_AUTH), read_buf1, strlen(NetName)+strlen(pass)+2);
						espUartTx(ClkRead(CLK_ST_WIFI_IP), read_buf1, strlen(NetName)+strlen(pass)+2);
					}
				}
			}
		}
	}
	pf_mount(0);
}

/************************************************************************/
/* Запрос IP адреса для режима station. Вынесено в процедуру для вызова */
/* из меню																*/
/************************************************************************/
void espGetIPStation(void){
	u08 i;
	espUartTx(ClkRead(CLK_ST_WIFI_IP), &i, 1);
}

/************************************************************************/
/* IP адрес получен                                                     */
/************************************************************************/
void UartStationIP(u08 cmd, u08* pval, u08 valLen){
	#define IP_LEN_STR (3*4+5)						//четыре октета по три знака плюс точки и нулевой байт

	if (espStationIP == NULL){
		espStationIP = malloc(IP_LEN_STR);
	}
	memcpy(espStationIP, pval, IP_LEN_STR);
	SetClockStatus(csTune, ssIP_Show);				//Вывести на дисплей
}

/************************************************************************/
/* Возврат в основной режим при получении команды CLC_STOP				*/
/************************************************************************/
void UartBaseModeSet(u08 cmd, u08* pval, u08 valLen){
	SetClockStatus(csClock, ssNone);
}

/************************************************************************/
/* Прочитать все настройки и счетчики  в часах                          */
/************************************************************************/
void UartGetAll(u08 cmd, u08* pval, u08 valLen){
	if ClkIsRead(cmd)
		espVarInit();
}
